import time

RESTORE = "\033[0;0m"

class COLOR32:
    """
    32 colors (16 Background + 16 Foreground)
    """
    # 样式
    STYLE ={
        "0" : "默认",
        "1" : "粗体",
        "2" : "细体",
        "3" : "斜体",
        "4" : "下划",
        "5" : "闪烁",
        "7" : "反色",
        "8" : "透明",
        "9" : "删除",
    }

    # 文本颜色
    TEXT_COLOR = {
        "01" : "默认",
        "30" : "黑色",
        "31" : "紅色",
        "32" : "綠色",
        "33" : "黃色",
        "34" : "藍色",
        "35" : "紫紅",
        "36" : "青藍",
        "37" : "灰色",
        "90" : "浅黑",
        "91" : "浅紅",
        "92" : "浅綠",
        "93" : "浅黃",
        "94" : "浅藍",
        "95" : "浅紫",
        "96" : "蓝绿",
        "97" : "浅灰",
    }

    # 背景颜色
    BACKGROUND_COLOR = {
        "01"  : "默认",
        "40"  : "黑色",
        "41"  : "紅色",
        "42"  : "綠色",
        "43"  : "黃色",
        "44"  : "藍色",
        "45"  : "紫紅",
        "46"  : "青藍",
        "47"  : "浅灰",
        "100" : "深灰",
        "101" : "浅红",
        "102" : "浅绿",
        "103" : "浅黃",
        "104" : "浅藍",
        "105" : "浅紫",
        "106" : "蓝绿",
        "107" : "白色",
    }

class COLOR256:
    """
    256 colors
    """

    # 前景色 or 后景色
    FGBG = {
        "38" : "前景",
        "48" : "后景",
    }

    # 固定常量
    CONSTANT = 5

    # Color Code
    COLOR_CODE = list(range(256))

CONTANT_DICT = {
    "@DATE" : lambda : time.strftime('%Y-%m-%d'),
    "@NOW" : lambda : time.strftime('%Y-%m-%d %H:%M:%S'),
    "@TIME" : lambda : time.strftime('%H:%M:%S'),
}